var _data = {

    /* класс -> направления */
    'class_to_directions': {
        'boy': {
            //7: [13],
            //8: [13],
            9: [1, 2, 3, 4, 5, 6, 7, 8, 9, 12],
            10: [1, 2, 3, 4, 5, 6, 7, 8, 9, 12],
            11: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
            'other': [14]
        },
        'girl': {
            //7: [13],
            //8: [13],
            9: [1,2,3,4,6,8,9,12],
            10: [1,2,3,4,6,8,9,12],
            11: [1,2,3,4,6,8,9,10,12],
            'other': [14]
        },
        'parent': {
            //7: [13],
            //8: [13],
            9: [1, 2, 3, 4, 5, 6, 7, 8, 9, 12],
            10: [1, 2, 3, 4, 5, 6, 7, 8, 9, 12],
            11: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
            'other': [14]
        },
        'ufo': {
            //7: [13],
            //8: [13],
            9: [1, 2, 3, 4, 5, 6, 7, 8, 9, 12],
            10: [1, 2, 3, 4, 5, 6, 7, 8, 9, 12],
            11: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
            'other': [14]
        }
    },

    /* направление -> специальности */
    'directions_to_specialities': {
        'boy': {
            9: {
                1: [1, 2],
                2: [3],
                3: [5],
                4: [6],
                5: [8, 9],
                6: [11, 12],
                7: [13],
                8: [16],
                9: [18],
                12: [25]
            },
            10: {
                1: [1, 2],
                2: [3],
                3: [5],
                4: [6],
                5: [8, 9],
                6: [11, 12],
                7: [13],
                8: [16],
                9: [18],
                12: [25]
            },
            11: {
                1: [1],
                2: [3],
                3: [4, 5],
                4: [6],
                5: [7, 10],
                6: [11],
                7: [13, 14],
                8: [15, 16, 17],
                9: [19],
                10: [20, 21],
                11: [22, 23],
                12: [24, 25]
            },
            'other': {
                14: [26, 27, 28]
            }
        },
        'girl':{
            9: {
                1: [1],
                2: [3],
                3: [5],
                4: [6],
                6: [11],
                8: [16],
                9: [18],
                12: [25]
            },
            10: {
                1: [1],
                2: [3],
                3: [5],
                4: [6],
                6: [11],
                8: [16],
                9: [18],
                12: [25]
            },
            11: {
                1: [1],
                2: [3],
                3: [4, 5],
                4: [6],
                6: [11],
                8: [15, 16, 17],
                9: [19],
                10: [20,21],
                12: [25]
            },
            'other': {
                14: [26, 28]
            }
        },
        'parent': {
            9: {
                1: [1, 2],
                2: [3],
                3: [5],
                4: [6],
                5: [8, 9],
                6: [11, 12],
                7: [13],
                8: [16],
                9: [18],
                12: [25]
            },
            10: {
                1: [1, 2],
                2: [3],
                3: [5],
                4: [6],
                5: [8, 9],
                6: [11, 12],
                7: [13],
                8: [16],
                9: [18],
                12: [25]
            },
            11: {
                1: [1],
                2: [3],
                3: [4, 5],
                4: [6],
                5: [7, 10],
                6: [11],
                7: [13, 14],
                8: [15, 16, 17],
                9: [19],
                10: [20, 21],
                11: [22, 23],
                12: [24, 25]
            },
            'other': {
                14: [26, 27, 28]
            }
        },
        'ufo': {
            9: {
                1: [1, 2],
                2: [3],
                3: [5],
                4: [6],
                5: [8, 9],
                6: [11, 12],
                7: [13],
                8: [16],
                9: [18],
                12: [25]
            },
            10: {
                1: [1, 2],
                2: [3],
                3: [5],
                4: [6],
                5: [8, 9],
                6: [11, 12],
                7: [13],
                8: [16],
                9: [18],
                12: [25]
            },
            11: {
                1: [1],
                2: [3],
                3: [4, 5],
                4: [6],
                5: [7, 10],
                6: [11],
                7: [13, 14],
                8: [15, 16, 17],
                9: [19],
                10: [20, 21],
                11: [22, 23],
                12: [24, 25]
            },
            'other': {
                14: [26, 27, 28]
            }
        }
    },
    'specialities_to_sp': {
        1: [1],
        2: [1],
        3: [2],
        4: [6],
        5: [6],
        6: [2],
        7: [3],
        8: [7],
        9: [1],
        10: [1],
        11: [4],
        12: [4],
        13: [5],
        14: [5],
        15: [4],
        16: [7],
        17: [5],
        18: [9],
        19: [9],
        20: [8],
        21: [8],
        22: [6],
        23: [2],
        24: [6],
        25: [2],
        26: [3,4],
        27: [4],
        28: [3]
    }
};

// Направления
var _directions = {
    1: 'Строительство и эксплуатация зданий и сооружений',
    2: 'Архитектура',
    3: 'Реставрация',
    4: 'Дизайн',
    5: 'Инженерные системы и благоустройство',
    6: 'Отделка',
    7: 'Деревообработка и мебель',
    8: 'Информационные технологии',
    9: 'Переработка нефти и газа и тонкая химическая технология',
    10: 'Логистика',
    11: 'Автодело',
    12: 'Гуманитарные науки',
    //13: 'ООШ',
    14: 'Профессиональная подготовка'
};

// Специальности
var _specialities = {
    1: 'Строительство и эксплуатация зданий и сооружений',
    2: 'Сварщик (электросварочные и газосварочные работы)',
    3: 'Архитектура',
    4: 'Реставрация',
    5: 'Реставратор строительный',
    6: 'Дизайн (по отраслям)',
    7: 'Техник инженерных систем (Мастер ЖКХ',
    8: 'Техническая эксплуатация и обслуживание электрического и электромеханического оборудования (по отраслям)',
    9: 'Электромонтер по ремонту и обслуживанию электрооборудования',
    10: 'Электромонтажник по сигнализации, централизации и блокировке',
    11: 'Мастер отделочных строительных работ',
    12: 'Специалист по строительным технологиям (Мастер сухого строительства)',
    13: 'Мастер столярного и мебельного производства',
    14: 'Технология деревообработки ',
    15: 'Наладчик программного и аппаратного обеспечения',
    16: 'Компьютерные сети',
    17: 'Информационные системы',
    18: 'Химическая технология органических веществ',
    19: 'Специалист по анализу химических веществ (Лаборант-аналитик)',
    20: 'Операционная деятельность в логистике',
    21: 'Организация перевозок и управление на транспорте (по видам)',
    22: 'Слесарь по ремонту строительных машин',
    23: 'Мастер шиномонтажной мастерской',
    24: 'Профессиональное обучение',
    25: 'Право и организация социального обеспечения',
    26: 'Маляр',
    27: 'Столяр',
    28: 'Рабочий зеленого хозяйства'

};

// СП
var _struct_deps = {
    1: {
        'title': '#1: на ул.Цимлянская',
        "center": [
            55.66865,
            37.769882
        ],
        'opendays':['22 марта', '23 марта', '30 марта']
    },
    2: {
        'title': '#2: на ул.Кожуховская',
        "center": [
            55.704463,
            37.67961
        ],
        'opendays':['21 марта', '28 марта', '5 апреля']
    },
    3: {
        'title': '#3: на ул.Фрезерная',
        "center": [
            55.739818,
            37.741387
        ],
        'opendays':['15 марта', '17 марта', '5 мая']
    },
    4: {
        'title': '#4: на ул.Шкулева',
        "center": [
            55.6943,
            37.75134
        ],
        'opendays':['13 марта', '14 марта', '23 марта']
    },
    5: {
        'title': '#5: на ул.Карачаровская',
        "center": [
            55.736367,
            37.757494
        ],
        'opendays':['17 марта', '18 марта', '2 апреля']
    },
    6: {
        'title': '#6: на ул.Трофимова',
        "center": [
            55.70386,
            37.679844
        ],
        'opendays':['16 марта', '19 марта', '22 марта']
    },
    7: {
        'title': '#7: на ул.Красноказарменная',
        "center": [
            55.741227,
            37.705778
        ],
        'opendays':['15 марта', '22 марта', '10 апреля']
    },
    8: {
        'title': '#8: на ул.Подъемная',
        "center": [
            55.756964,
            37.697657
        ],
        'opendays':['17 марта', '24 марта', '25 марта']
    },
    9: {
        'title': '#9: на шоссе Энтузиастов',
        "center": [
            55.753448,
            37.72467
        ],
        'opendays':['15 марта', '19 марта', '28 марта']
    }
};